In [1]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='지원번호')

In [4]:
df['키'][0:3]
df['수학'][2:6]

지원번호
3번    70
4번    70
5번    10
6번    95
Name: 수학, dtype: int64

In [5]:
# 이름, 수학 2번째 부터 5번째까지 가져오기
df[['이름', '수학']][1:5]

       이름  수학
지원번호
2번    강태원  50
3번    강호림  70
4번    김수찬  70
5번    김재욱  10

In [ ]:
# row의 데이터 가져오기, 슬라이싱
df[0:3] # 0부터 3까지 가져오기
df[:4] # 처음부터 4까지 가져오기
df # 전체 가져오기
df[3:] # 3부터 끝까지 가져오기

df[['이름', '학교', 'SW특기']][:3] # 이름, 학교, SW특기 컬럼의 위 3개를 가져오기

       이름   학교        SW특기
지원번호
1번    강나래  구로고      Python
2번    강태원  구로고        Java
3번    강호림  가산고  Javascript

In [11]:
### row의 값을 가져오는 방법 2가지, df 슬라이싱, df.iloc 슬라이싱
df[1:3]
df.iloc[1:3]

       이름   학교    키  국어  영어  수학  사회        SW특기
지원번호
2번    강태원  구로고  184  40  35  50  25        Java
3번    강호림  가산고  168  80  75  70  75  Javascript